{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "./models/esm2/esm2_t33_650M_UR50D",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 24,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "dense",
    "query",
    "key"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "use_dora": false,
  "use_rslora": false
}